// registration deadline config
export const deadline = "2018-11-13T00:00:00"

// general question array size
export const generalQuestionSize = 3

// major question array size
export const majorQuestionSize = {
  design: 4,
  content: 3,
  marketing: 3,
  programming: 4,
}

// questions (general & special)
export const questions = {
  general: [
    "“Ready to Disrupt นวัตกรรมเว็บเปลี่ยนโลก” สำหรับน้องๆหมายความว่าอย่างไร",
    "น้องๆ คาดหวังอะไรจากการเข้าค่าย YWC16 ในปีนี้",
    "ให้น้องๆ หาเหตุผลของการมีอยู่ของสมุดสำเนาทะเบียนบ้าน และเหตุผลที่ไม่จำเป็นต้องมีของสมุดสำเนาทะเบียนบ้าน",
  ],
  programming: [
    "ให้น้องเล่าประสบการณ์การทำงานเกี่ยวกับการทำหรือพัฒนาเว็บไซต์ (สามารถแปะลิงค์ผลงานที่เคยทำไว้ได้)",
    "ให้น้องเลือก Technology, Library หรือแนวคิดใหม่ๆ ในการทำเว็บมาหนึ่งอย่างพร้อมกับอธิบายว่าคืออะไร และทำไมถึงตัดสินใจเลือกอันนี้",
    "ให้ออกแบบระบบจองห้องประชุมของห้องสมุดมหาวิทยาลัย โดยให้ระบุ Feature ที่อยากให้มี, เทคโนโลยีที่จะเลือกใช้, โครงสร้างของฐานข้อมูล และ wireframe ของหน้าจอแบบคร่าว ๆ",
    "จงเขียน function cardAt ที่รับค่า n และคืนค่าเป็นเลขของไพ่ในสำรับลำดับที่ n โดยเรียงตามดอกไพ่ (C, D, H, S) และเลขไพ่ (2, 3, 4, 5, 6, 7, 8, 9, 0, J, Q, K, A) ตามลำดับ ตัวอย่างเช่น cardAt(0) = 2C, cardAt(1) = 3C, cardAt(34) = 0H และ cardAt(35) = JH เป็นต้น โดยเขียนคำตอบมาโดยใช้ภาษาใดก็ได้ หรือเป็น psuedocode ก็ได้เช่นกัน",
  ],
  design: [
    "ถ้าให้ในอนาคตน้องได้รับโอกาสเป็นนักออกแบบเครื่องมือสำคัญในการ “เปลี่ยนโลก” หรือสร้างการเปลี่ยนแปลงในสังคมในทางที่ดีขึ้น น้องคิดว่าจะออกแบบอะไร ในรูปแบบไหนบ้าง และจะนำเครื่องมือที่น้องออกแบบนั้นมาเปลี่ยนแปลงในด้านใด",
    "ถ้าให้น้องเปรียบเทียบนิสัยและบุคลิกของตัวน้องกับเว็บไซต์ เว็บไซต์ที่สามารถสื่อถึงตัวตนของน้องคือเว็บอะไร พร้อมบอกเหตุผล",
    "ให้น้องหาตัวอย่างการออกแบบ UX บนเว็บขายสินค้า 3 เว็บ เว็บละ 1 จุด รวมทั้งหมด 3 จุด ที่ทำให้เราตัดสินใจซื้อสินค้าได้เร็วขึ้น",
    "แนบ Portfolio ของตัวเอง",
  ],
  content: [
    "จินตนาการว่าน้องเป็นหัวหน้าพรรคการเมืองหน้าใหม่ และต้องการทำ Online Content 1 โพสต์",
    'บริษัท แนนโน๊ะ จำกัด ต้องการประกาศรับสมัครพนักงานตำแหน่ง Digital Content Creator เพื่อทำหน้าที่สร้างสรรค์คอนเทนต์และเผยแพร่ในสื่อโซเชียล คุณในฐานะผู้ช่วยของแนนโน๊ะได้รับมอบหมายให้สร้างสรรค์ "ประกาศรับสมัครงาน" เพื่อโพสต์ลงโซเชียลโดยหวังผลให้เกิด Engagement (Like, Share, Comment) จนประกาศนี้ถูกบอกต่อในวงกว้าง (หมายเหตุ เงินเดือนและสวัสดิการของบริษัทนี้เป็นไปตามมาตรฐานทั่วไป ไม่มีอะไรที่พิเศษหรือโดดเด่นกว่าบริษัทอื่นจนนำมาเป็นจุดขายได้)',
    "Content เพื่อบอกเล่าถึงวงการ E-Sport โดยเป้าหมายคือ ผสานความเข้าใจระหว่างคนยุคเก่าและคนยุคใหม่",
  ],
  marketing: [
    "อะไรคือปัจจัยสำคัญที่นักการตลาดต้องศึกษาและเข้าใจ เพื่อใช้ในการวางแผนกลยุทธ์ให้ธุรกิจประสบความสำเร็จ จงยกตัวอย่างพร้อมอธิบาย (ตอบแยกเป็นข้อไม่ต่ำกว่า 3 ข้อย่อย)",
    "จงยกตัวอย่างธุรกิจที่คุณคิดว่าเหมาะที่จะใช้คำว่า Disrupt ที่สุดมา 1 ธุรกิจ และจงอธิบายว่าเพราะอะไรจึงคิดเช่นนั้น",
    "จงยกตัวอย่างธุรกิจเว็บไซต์ หรือแอพพลิเคชั่นที่คุณรู้จัก (เช่น Grab, Ookbee, Agoda ฯลฯ) มา 1 ธุรกิจ แล้วสมมติว่าธุรกิจดังกล่าวเป็นธุรกิจใหม่ที่เพิ่งจะเปิดตัวในตลาดประเทศไทย มีงบการตลาดสำหรับสื่อสารและประชาสัมพันธ์เดือนละ 1 แสนบาท จงอธิบายว่าคุณจะใช้กลยุทธ์ทางการสื่อสารการตลาดอย่างไร ผ่านช่องทางใด อย่างไรบ้าง เพื่อให้ธุรกิจประสบความสำเร็จมากที่สุดภายในระยะเวลา 12 เดือน (คำตอบไม่เกิน 1 หน้า A4 โดยประมาณ)",
  ],
}
